assignment-4-app-ar/app/controllers/students_controller.rb

    def show
        @student = Student.find(student_params)
---
SELECT "students".* FROM "students" WHERE "students"."student_id" = $1 LIMIT $2  [["student_id", nil], ["LIMIT", 1]]

    def getAllStudents
        @students = Student.all
---
SELECT "students".* FROM "students"

    def addStudent
        emailTaken = Student.find_by(email: params[:student][:email])
        errors = []

        if emailTaken || params[:student][:email].empty?
            errors <<  "The email is already taken or empty"
        end

        if params[:student][:first_name].empty?
            errors << "First name cannot be null"
        end

        if params[:student][:last_name].empty?
            errors << "Last name cannot be null"
        end

        @student = Student.new(student_params)
        unless @student.save
---
SELECT "students".* FROM "students" WHERE "students"."email" = $1 LIMIT $2  [["email", "asd"], ["LIMIT", 1]]
SELECT "students".* FROM "students" WHERE "students"."student_id" = $1 LIMIT $2  [["student_id", nil], ["LIMIT", 1]]
SELECT 1 AS one FROM "students" WHERE "students"."email" = $1 LIMIT $2  [["email", "ASD"], ["LIMIT", 1]]
INSERT INTO "students" ("first_name", "last_name", "email", "enrollment_date") VALUES ($1, $2, $3, $4) RETURNING "student_id"  [["first_name", "A"], ["last_name", "ASDASd"], ["email", "ASDASDD"], ["enrollment_date", "2023-11-26"]]

    def updateStudentEmail
        @student = Student.find_by(params[:student][:student_id])
        emailTaken = Student.find_by(email: params[:student][:email])
        errors = []

        if params[:student][:email].empty? || emailTaken
            errors <<  "The email is empty or taken"
        end

        if params[:student][:student_id].nil? || !params[:student][:student_id].is_a?(Integer)
            errors <<  "Student id is not valid"
        end

        @student.update(email: params[:student][:email])
---
SELECT "students".* FROM "students" WHERE "students"."student_id" = $1 LIMIT $2  [["student_id", nil], ["LIMIT", 1]]
SELECT "students".* FROM "students" WHERE "students"."email" = $1 LIMIT $2  [["email", ""], ["LIMIT", 1]]
SELECT 1 AS one FROM "students" WHERE "students"."email" = $1 AND "students"."student_id" != $2 LIMIT $3  [["email", "\"john.doe@example.com\""], ["student_id", 4], ["LIMIT", 1]]
UPDATE "students" SET "email" = $1 WHERE "students"."student_id" = $2  [["email", "\"john.doe@example.com\""], ["student_id", 4]]

    def deleteStudent
        @student = Student.find_by(student_id: params[:student][:student_id])
        errors = []

        if params[:student][:student_id].empty?
            errors <<  "Student id is not valid"
        else
            @student.destroy
---
SELECT "students".* FROM "students" WHERE "students"."student_id" = $1 LIMIT $2  [["student_id", nil], ["LIMIT", 1]]
DELETE FROM "students" WHERE "students"."student_id" = $1  [["student_id", 4]]