assignment-4-app-ar/app/controllers/students_controller.rb

UPDATE "students" SET "email" = $1 WHERE "students"."student_id" = $2  [["email", "\"john.doe@example.com\""], ["student_id", 4]]
---
    def updateStudentEmail
        @student = Student.find_by(student_id: params[:student][:student_id])
        emailTaken = Student.find_by(email: params[:student][:email])
        errors = []

        if emailTaken
            errors <<  "The email is taken"
        end

        if @student.nil?
            errors <<  "Student id is not valid"
        else
            @student.update(email: params[:student][:email])